{"name": "Convallaria", "alt_names": ["Lily of the Valley"], "description": "Convallaria is a small genus in the family Asparagaceae, native to temperate regions of the Northern Hemisphere. The genus is composed of three species – Convallaria majalis, Convallaria montana and Convallaria keiskei.They live in shady places and are one of the most fragrant blooming plants in the spring and early summer. These plants produce delicate bell-shaped flowers and small red berries at maturity. A dark green foliage acts as a great backdrop for the small, pendant and waxy flowers that are usually white. Each flower has six petals fused into dangling bells along one side at the top of the flower stalk. Lily of the Valley is a great plant for a woodland garden or as ground cover in shady borders.", "img_urls": ["https://www.atozflowers.com/wp-content/uploads/2018/10/25078089045_6c1efce8f9_z-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/10/26923335422_63fac4b07a_z-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/10/27113115035_cf3acd7be2_z-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/10/42315267332_7ec7916119_b-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/10/Convallaria_keiskei_2-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/10/Convallaria_majalis_0002-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/10/Lily_of_the_valley_3604196572-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/10/Lily-of-the-Valley_-_Flickr_-_pellaea_1-150x150.jpg"], "meaning": "The scientific name is derived from the Latin word “convallis”, meaning “valley”, in reference to the steep slope of the leaves forming a valley when paired. The genus was formerly placed in the lily family (Liliaceae), hence the common name Lily of the Valley.The common name Lily of the Valley usually refers to Convallaria majalis, but it is also a common name for all plants in the Convallaria genus.", "symbols": ["Death", "Happiness", "Purity", "Sadness"], "color_description": "These small flowers are usually white, but sometimes pink.", "seasons": ["Spring", "Summer"], "colors": ["pink", "white"]}