{"name": "Epimedium", "alt_names": ["Barrenwort", "Bishop's hat", "Horny Goat Weed"], "description": "Epimedium is a genus of about 60 species in the family Berberidaceae, native to Europe and Asia and distributed in areas around the Mediterranean Sea and Eastern Asia.These shade-loving plants have charming, heart-shaped or arrowhead-shaped leaves and beautiful star-shaped flowers in various colors. Epimediums are long-lived perennials and good ground covers known for their toughness, strength and ability to compete with tree roots, which makes them a great choice for any shade garden.", "img_urls": ["https://www.atozflowers.com/wp-content/uploads/2018/09/Epimedium_pubigerum_flowers-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/09/Epimedium_leptorrhizum-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/09/Epimedium_grandiflorum_var._thunbergianum_flower_section-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/09/Epimedium_rubrum_2016-04-22_8648-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/09/Epimedium_grandiflorum_var._thunbergianum_flower-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/09/Epimedium_grandiflorum_2-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/09/Epimedium_davidii_-_Flickr_-_peganum_2-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/09/4522888353_f43dfd9c0a_z-150x150.jpg"], "meaning": "Genus name is of unclear origin and meaning. It is believed to be a latinized version of a Greek name for a different plant – “Epimedion”. The common name “Barrenwort” was given because the plant tolerates shade and dry soil, growing in “barren” environments. It was also believed to cause barrenness in women. The name Bishop’s hat comes from the shape of the flower. The common name “Horny Goat Weed” also deserves some explanation. The legend says that it got its name when a Chinese shepherd noticed that eating the plant caused his male goats to become very excitable. The plant contains the active ingredient called icariin, one of nature’s most powerful aphrodisiac compounds. Icariin is also great as a supplement for athletes and bodybuilders.", "symbols": ["Fertility", "Strength"], "color_description": "These flowers come in many stunning colors, including white, red, pink, purple, yellow and orange, as well as bi-colored varieties.", "seasons": ["Spring", "Autumn", "Winter", "Summer"], "colors": ["orange", "pink", "purple", "red", "white", "yellow"]}