{"name": "Helenium", "alt_names": ["Sneezeweed"], "description": "Helenium is a genus of about 40 species in the family Asteraceae, native to the Americas.Helenium produces bright green foliage and long, thin stalks with vibrant, daisy-like flowers that bloom in summer and fall. Each flower is actually a group of smaller flowers composed of a central circular group of tiny disk flowers (disk florets), and an outer ring of larger ray flowers (ray florets), the so-called “petals” that may face outward from the center or may droop downward. These sun-loving plants will add bright colors to your garden, attracting butterflies and other pollinators.", "img_urls": ["https://www.atozflowers.com/wp-content/uploads/2018/09/Helenium_El_Dorado-700x500.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/09/sun-brews-3669825_1920-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/09/helenium-485785_1920-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/09/Helenium_urmenetae_Flower_01-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/09/Helenium_autumnale_2017-10-15_01-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/09/36532036080_6c316f48af_z-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/09/35744344025_303186aed9_z-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/09/21473733916_6e245e1344_z-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/09/15919700495_1602132485_z-150x150.jpg"], "meaning": "The genus name is derived from “helenion”, a Greek name for a different plant.The name originates from Greek mythology and refers to a plant which honors Helen of Troy. According to Greek mythology, Helen of Troy, the daughter of Greek God Zeus and Spartan queen Leda, was the most beautiful woman in the world. There is a myth that her tears produced a similar plant on the island of Pharos. The flowers started to grow from the ground soaked with tears of Helen of Troy. The plant is commonly known as “Sneezeweed”. The dried flowers and leaves of Helenium have been used as a snuff to induce sneezing to clear head colds or headaches, and to scare away evil spirits and demons. However, the plant isn’t a weed, and it doesn’t cause sneezing.", "symbols": ["Tenderness"], "color_description": "Helenium flowers come in shades of yellow, orange, red and brown.", "seasons": ["Autumn", "Summer"], "colors": ["brown", "orange", "red", "yellow"]}