{"name": "Narcissus", "alt_names": ["Daffodil"], "description": "Narcissus is a genus of bulbous perennials in the Amaryllidaceae family. There are more than 100 species of this plant, which is native to Europe, Asia and North Africa.Narcissi are usually white or yellow, with six petals (technically, “tepals” or “perianth segments”) and a trumpet-shaped central corona. They are some of the first to bloom in the early spring, announcing the end of winter. Narcissus is one of the most popular flowers in the world, mainly due to the well-known myth of the Greek youth who fell in love with himself.", "img_urls": ["https://www.atozflowers.com/wp-content/uploads/2017/11/Narcissus_Flower_Record_01-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/11/yellow-narcissus-14890708942Jd-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/11/Narcissus_medioluteus2-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/11/3549751834_151345d289_z-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/11/yellow-narcissus-1491068748CTF-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/11/116c62aa293f6debdce68b8a6bb1ab25-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/11/Narcissus_yellow-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/11/Narcissus_botanical_garden_jerusalem-150x150.jpg"], "meaning": "The genus name comes from the Latin word “narcissus”, which is derived from the Greek “narkissos” and associated with Greek “narke”, meaning “numbness”, because of the sedative effect of the plant. The common name Daffodil is derived from the “Affodell”, a variant of “Asphodel” which is a genus of popular garden plant.The name Daffodil refers to all members of the genus Narcissus. However, the name also refers to the Narcissus pseudonarcissus, which is identified by its narrow, grey-green leaves and yellow petals with darker central trumpet.", "symbols": ["Good fortune", "New beginnings", "Rebirth"], "color_description": "These flowers are usually white and yellow.", "seasons": ["Spring"], "colors": ["white", "yellow"]}