{"name": "Nelumbo", "alt_names": ["Lotus"], "description": "Nelumbo, commonly called Lotus, is a genus of aquatic plants containing only two species – Nelumbo nucifera and Nelumbo lutea, which belong to the Nelumbonaceae family. These plants are aquatic perennials native to tropical Asia and Australia (Nelumbo nucifera) and North America (Nelumbo lutea), growing in the mud of lagoons, lakes, swamps, ponds and waterlogged fields.They have wide and disc-shaped leaves at or above the water surface, and beautiful flowers rising above the water. The flowers are large and usually found on thick stems. These beauties will attract birds and insects, as well as people!", "img_urls": ["https://www.atozflowers.com/wp-content/uploads/2017/12/Sacred_lotus_Nelumbo_nucifera-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/12/Nelumbo_lutea_3-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/12/Mrs._Perry_D._Slocum_Sacred_Lotus_in_full_bloom_at_Brooklyn_Botanic_Garden_24_July_2009-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/12/lotus-1790717_1280-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/12/Nelumbo_lutea-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/12/Nelumbo_nucifera_2-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/12/601px-American_Lotus_Nelumbo_lutea_01-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/12/lotus-4436_1280-150x150.jpg"], "meaning": "The genus name is derived from the Sinhalese word “Nelum”, meaning blue. The common name is derived from the Latin “lotus” and Greek “lotos”, name used for several plants before it came to mean Egyptian white lotus (Nymphaea lotus). Nelumbo nucifera is commonly called “Sacred Lotus” or “Indian Lotus”, while Nelumbo Lutea is also known as “American Lotus”.The name Lotus is used as a common name for many species and genera in various botanical families. It is used for the specific genus in the family Fabaceae and also for other genera and species such as Saussurea genus (commonly known as “Snow Lotus”), Nelumbo genus (Nelumbo nucifera, Nelumbo lutea), certain species of Nymphaea genus (Nymphaea caerulea, Nymphaea lotus, Nymphaea nouchali), the species Ziziphus Lotus in the Ziziphus genus and the Diospyros Lotus, a species of the genus Diospyros.", "symbols": ["Beauty", "Fertility", "Grace", "Purity", "Rebirth", "Wealth"], "color_description": "Nelumbo nucifera has white or pink flowers, while Nelumbo lutea has yellow ones.", "seasons": ["Spring", "Summer"], "colors": ["pink", "white", "yellow"]}