{"name": "Oenothera", "alt_names": [], "description": "Oenothera is a genus of about 100 species of herbaceous plants in the family Onagraceae, native to the Western Hemisphere.Oenothera has simple or lobed leaves and fragrant, bowl-shaped flowers. It has four petals, four sepals and eight stamens. Oenotheras are versatile and can be used in a variety of landscape settings!", "img_urls": ["https://www.atozflowers.com/wp-content/uploads/2017/12/8709262850_e5f2271529_c-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/12/5527360_0920490f-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/12/18329095141_9278e531cb_k-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/12/14726461753_93c955d037_k-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/12/42328577201_9c618ccbd3_c-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/12/Unidentified_Oenothera_flowers_buds-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/12/white-evening-primrose-wildflower-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/12/Oenothera_biennis_20050825_922-150x150.jpg"], "meaning": "It is believed that the name “Oenothera” comes from the Greek words “oinos” and “theras”, meaning “wine-seeker”, which refers to an ancient use of the plant in scenting wine. There are many common names for different species of Oenothera.For example, Oenothera biennis, Oenothera lamarckiana and some other species are commonly known as “Evening Primroses”. The name Evening Primrose refers to the habit of the plant to open its flowers only in the evening. Oenothera Mexicana is commonly called “Mexican Evening Primrose”. Oenothera fruticosa is also known as “Sundrops” or “Southern Sundrops”, while Oenothera elata is known by the common name “Hooker’s Evening Primrose” or “Tall Evening Primrose”.", "symbols": ["Love", "Protection", "Youth"], "color_description": "Oenothera produces yellow, pink and white flowers.", "seasons": ["Spring", "Autumn", "Summer"], "colors": ["pink", "white", "yellow"]}