{"name": "Ornithogalum", "alt_names": ["Star of Bethlehem"], "description": "Ornithogalum, commonly known as Star of Bethlehem, is a genus of more than 150 species of bulbous perennials in the family Asparagaceae, native to Europe, Asia and southern Africa.Ornithogalum blooms in spring or summer and features multiple star-shaped or cup-shaped blooms that rise on long, brilliant green stems above the semi-erect, grass-like foliage. These plants will grow well in light shade or full sun if they get enough water. Plant them in containers, borders, wild gardens, rock gardens or open woodlands, and they will surprise you with their amazing beauty and charm. Plus, they are one of the longest-lasting cut flowers around!", "img_urls": ["https://www.atozflowers.com/wp-content/uploads/2017/12/Ornithogalum_umbellatum-1-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/12/ORNITHOGALUM_UMBELLATUM_-_MONTSEC_-_IB-085_Llet_de_gallina-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/12/Ornithogalum_dubium_C-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/12/Ornithogalum_dubium_B-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/12/40973054814_05aa115d18_z-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/12/493107861_5fb4d6a92c_z-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/12/33125469741_1b2344a531_z-150x150.jpg"], "meaning": "The botanical name is derived from the Greek words “ornithos” (“bird”) and “gala” (“milk”), in reference to the white color of the flowers.The Greek phrase “bird’s milk” was also used to describe something amazing. Many species within the genus share the common name “Star of Bethlehem”, though it is most often used for the Ornithogalum umbellatum. The common name refers to the star-shaped flowers of the plant.", "symbols": ["Death", "Honesty", "Hope", "Innocence", "Trust"], "color_description": "The flowers come in white, yellow and orange colors.", "seasons": ["Spring", "Summer"], "colors": ["orange", "white", "yellow"]}