{"name": "Plumeria", "alt_names": ["Frangipani", "Hawaiian Lei Flower"], "description": "Plumeria, also known as Frangipani, is a genus of about 300 species of flowering tropical plants, native to Central America, Mexico, South America, and the Caribbean. Plumeria species belong to the Apocynaceae family, commonly called the dogbane family. They are popular ornamental plants that can be grown as shrubs or small trees.Plumeria is a fast growing plant that produces masses of blossoms that bloom from spring until early fall. It is popular for its fragrant, large flowers and beautiful assortment of colors. Once planted, you will definitely love to watch your Plumeria plant grow!", "img_urls": ["https://www.atozflowers.com/wp-content/uploads/2018/01/Starr_070124-3845_Plumeria_obtusa-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/01/plumeria-yellow-and-white-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/01/plumeria-or-frangipani-flowers-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/01/Plumeria_alba2709449426-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/01/Frangipani_flower_plumeria-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/01/800px-Plumeria-150x150.jpeg", "https://www.atozflowers.com/wp-content/uploads/2018/01/flowers-2967730_1920-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/01/Frangipani_flowers-150x150.jpg"], "meaning": "The genus name was given in honor of Charles Plumier (1646-1704), a French botanist. The common name “Frangipani” comes from the Italian nobleman, Marquis Frangipani, who created a perfume used to scent gloves in the 16th century. When the Plumeria flower was discovered, the scent was similar to the scent used in the gloves. The name began to be associated with the plant and Plumeria flowers soon became known as Frangipani flowers.Another theory is that the name was derived from the French word “frangipanier”, which means “coagulated milk”, because of the appearance of Plumeria milk.", "symbols": ["Beauty", "Charm", "Grace", "New beginnings"], "color_description": "These flowers can be found in shades of white, yellow, pink and red.", "seasons": ["Spring", "Autumn", "Summer"], "colors": ["pink", "red", "white", "yellow"]}