{"name": "Polygonatum", "alt_names": ["Solomon's Seal"], "description": "Polygonatum is a genus of about 70 species of flowering plants in the family Asparagaceae, distributed across the temperate regions of the Northern Hemisphere.These shade-loving plants produce small, tubular flowers during spring and summer, followed by berries which turn dark blue in late summer. The flowers are pendulous and dangle from slender, arching stems. These are the plants that will add structure, motion and interest to woodland gardens or shady borders. In addition, the gorgeous berries will attract wildlife to your garden, such as hummingbirds and other feathered friends.", "img_urls": ["https://www.atozflowers.com/wp-content/uploads/2020/09/white-wurzen-4198351_1280-700x500.jpg", "https://www.atozflowers.com/wp-content/uploads/2020/09/solomons-seal-3391920_1280-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2020/09/26750240560_f5ac2d2921_c-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2020/09/47967189443_60f33a815b_c-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2020/09/5673602440_151b751523_c-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2020/09/polygonatum-odoratum-338936_1280-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2020/09/solomon-seal-flowers-2186711_1280-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2020/09/solomons-seal-2243378_1280-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2020/09/5673066571_b57f20be70_c-150x150.jpg"], "meaning": "The genus name is derived from the Greek words “poly”, meaning “many,” and “gonu”, meaning “knees”. It literally means “many knees”, apparently in reference to the knee-like shape of underground rhizomes. The common name “Solomon’s Seal” was given after the biblical figure King Solomon. The name comes from the flat, round scars on the rhizomes, resembling the impressions of a seal. In some species these scars resemble two overlapped triangles, which is the ancient symbol of the King Solomon. According to the Bible, King Solomon was the King of Israel from 970 B.C. to 931 B.C., and was recognized as a man of peace and wisdom.", "symbols": ["Peace", "Wisdom"], "color_description": "The flowers come in white, green or pink, in solid colors or in combinations.", "seasons": ["Spring", "Summer"], "colors": ["green", "pink", "white"]}