{"name": "Tricyrtis", "alt_names": ["Toad Lily"], "description": "Tricyrtis is a genus of about 20 species in the family Liliaceae, native to moist woodlands and high elevations of eastern Asia.These shade-loving perennials produce exotic, orchid-like flowers that bloom in summer and autumn. The flowers have six petals that are covered with hundreds of small purple spots. They are star-shaped or bell-shaped and are often borne on upright, arching stems.", "img_urls": ["https://www.atozflowers.com/wp-content/uploads/2018/08/Tricyrtis_hirta_-_blossom_top_aka-700x500.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/08/Lily_of_a_Toad_2959404257-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/08/tricyrtis-hirta-2736905_1920-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/08/tricyrtis-hirta-417575_1920-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/08/Tricyrtis_hirta-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/08/Tricyrtis_formosana_Baker_JdP_2-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/08/flora-3034055_1920-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/08/24782666462_70e463149d_z-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/08/3647998_6dd4dc97-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/08/800_9519-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2018/08/800_9518-150x150.jpg"], "meaning": "The genus name comes from the Greek words “tri”, meaning “three“, and “kyrtos”, which means “bulging” or “humped”, as the bases of the three outer petals are sack-like and swollen. The plant acquired its common name from the popular fraud called Tasaday hoax.In 1971, a man named Manuel Elizalde, advisor to the president of the Philippines Ferdinand Marcos, had bribed some locals to pose as Stone Age people. He announced that he had discovered a tribe of people who had lived for thousands of years in isolation. Expressing fear that their habitat would be damaged or seriously disturbed by the encroachments of civilization, the Marcos Government created a preserve for them and put it off limits to loggers and farmers. The government declared a 19,000-hectare (47,000-acre) reservation around the caves soon after the story about tribe that spoke a dialect lacking the words “war”, “weapon” or “enemy” was released. The area remained off limits until 1986. The other goal was to increase ecotourism to the Philippines and to obtain money from philanthropists. The Tasaday story created an immediate sensation and gained worldwide attention. The tribe was even documented by National Geographic and the story was first published in the 1972 National Geographic documentary “The Last Tribes of Mindanao”. The truth was not revealed until 1986, when Ferdinand and Imelda Marcos were removed from power.Filipino “tribe” called the Tasaday rubbed the scented juice of the plant before going frog hunting. The smell was said to attract frogs and the stickiness made it easier to catch them. It is now believed that the idea that one could attract toads by the scent of the plant was nonsense.Even though the hoax was later exposed, the common name of Toad Lily for the Tricyrtis is still relevant today.", "symbols": ["Fertility"], "color_description": "The flowers come in shades of red, purple, white and yellow.", "seasons": ["Autumn", "Summer"], "colors": ["purple", "red", "white", "yellow"]}