{"name": "Yucca", "alt_names": [], "description": "Yucca is a genus of about 50 species of evergreen perennials, shrubs and trees. It belongs to the family of Asparagaceae and is native to North America, Mexico and the Caribbean.These versatile and easy-to-care plants come in a wide variety of sizes and shapes. They are known for their spiky sword-like leaves and beautiful bell-shaped flowers. The flowers are usually fragrant and white or cream in color. They are ideal for people who have little time or travel frequently because of their low maintenance requirements.", "img_urls": ["https://www.atozflowers.com/wp-content/uploads/2017/11/Mojave_yucca_in_bloom_at_Indian_Cove_Campground_Twentynine_Palms_CA-700x500.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/11/Yucca_periculosa-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/11/Yucca_in_fiore-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/11/Yucca_gloriosa1-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/11/Yucca_filamentosa_Color_Guard-IMG_5551-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/11/Yucca_01-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/11/3788586746_dd70328073_o-150x150.jpg", "https://www.atozflowers.com/wp-content/uploads/2017/11/Yucca_brevifolia_inflorescence-150x150.jpg"], "meaning": "The genus name comes from the Taino (native Caribbean) name for the plant Yuca.The name “Yucca” was mistakenly given to the genus by Carl Linnaeus, as it is the Latinized variation of “Yuca”, the Caribbean name for Cassava (Manihot esculenta). Early American settlers called them “Lamparas de Dios” or “the Lamps of God”, due to their beautiful white flowers that seemingly lit the way during their long and dangerous journey.", "symbols": ["Protection", "Purity"], "color_description": "The Yucca plant has green, sword-like leaves and white or whitish flowers.", "seasons": ["Spring", "Autumn", "Summer"], "colors": ["green", "white"]}